### [Pandas]
- 자동적 혹은 명시적인 축의 이름에 따라 데이터를 정렬할 수 있는 자료구조.
- 색인데이터를 다룰수 있는 기능
- 통합된 시계열
- 통합자료구조
- 데이터를 합치고 관계연산을 수행하는 기능.

In [1]:
from pandas import Series, DataFrame
from __future__ import division
from numpy.random import randn
import numpy as np
import os
import matplotlib.pyplot as plt
np.random.seed(12345)
plt.rc('figure', figsize=(10, 6))
from pandas import Series, DataFrame
import pandas as pd
np.set_printoptions(precision=4)

In [2]:
%pwd

'F:\\Jupyternotebook\\version_3.0\\pydataAnalysis'

## 5.1: Pandas 자료구조 소개

### 5.1.1 Series
- 일련의 객체를 담을 수 있는 1차원 배열같은 자료구조.

In [3]:
obj = Series([4,2,1,2])
obj

0    4
1    2
2    1
3    2
dtype: int64

In [4]:
obj.values
obj.index

RangeIndex(start=0, stop=4, step=1)

In [5]:
obj2 = Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c']) # 인덱스 지정
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [7]:
obj2['a']
obj2['d'] = 6
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [8]:
obj2[obj2 > 0]

d    6
b    7
c    3
dtype: int64

In [9]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [10]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [11]:
'b' in obj2 # 인덱스가 있는지

True

In [12]:
'e' in obj2

False

In [13]:
# 사전형도 저장 가능.
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [14]:
states = ['California', 'Oregon','Ohio', 'Texas']
obj4 = Series(sdata, index=states) # index가 있는거만 매칭되서 나옴 >> 아닌것은 nan값으로
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Texas         71000.0
dtype: float64

In [15]:
# NA, 누락된 데이터 지칭시 사용 : isnull, notnull
pd.isnull(obj4)
pd.notnull(obj4)

California    False
Oregon         True
Ohio           True
Texas          True
dtype: bool

In [16]:
obj4.isnull()

California     True
Oregon        False
Ohio          False
Texas         False
dtype: bool

In [18]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [20]:
obj4

California        NaN
Oregon        16000.0
Ohio          35000.0
Texas         71000.0
dtype: float64

In [22]:
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [25]:
## 중요속성 : name!
obj4.name = 'population'
obj4.index.name = 'state'
obj4

state
California        NaN
Oregon        16000.0
Ohio          35000.0
Texas         71000.0
Name: population, dtype: float64

In [27]:
obj.index = ['Bob', 'Steve', 'Jeff', 'Ryan']
obj

Bob      4
Steve    2
Jeff     1
Ryan     2
dtype: int64

### 5.1.2 DataFrame
- 표 같은 스프레드시트 형식의 자료구조.
- 각 컬럼은 서로 다른 종류의 값(숫자, 문자열, 불리언 등)을 담을 수 있음
- row, column에 대한 색인이 있음.(2차월 배열 형식으로 저장됨)

In [3]:
# dataframe에 자료를 넣기 위한 방식은 리스트에 담긴 사전을 주로 이용.
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada'],
        'year': [2000, 2001, 2002, 2001, 2002],
        'pop': [1.5, 1.7, 3.6, 2.4, 2.9]}
frame = DataFrame(data)

In [4]:
frame

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [5]:
# 원하는 컬럼 순서대로!
DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [7]:
# data에 없는 값을 넘기면 NAN값이 저장됨.
frame2 = DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                   index=['one', 'two', 'three', 'four', 'five'])
frame2

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [8]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [9]:
frame2['state']

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [10]:
frame2.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [11]:
frame2.iloc[:,0] # iloc: integer position으로만 가능!

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [13]:
frame2.loc['one',:] # loc : index label로만 가능.

year     2000
state    Ohio
pop       1.5
debt      NaN
Name: one, dtype: object

In [14]:
frame2.ix[:,0] # ix : index label 및 integet postion으로 둘다가능(현재는 잘 안씀.)

C:\Users\hwany\Anaconda3\envs\py36\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

one      2000
two      2001
three    2002
four     2001
five     2002
Name: year, dtype: int64

In [15]:
frame2.loc[frame2.state != 'Ohio']

      year   state  pop debt
four  2001  Nevada  2.4  NaN
five  2002  Nevada  2.9  NaN

In [17]:
# 새로운 배열값을 대입.
frame2['debt'] = 16.5
frame2

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [16]:
# 새로운 배열값을 대입.
frame2['debt'] = np.arange(5.)
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [18]:
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
frame2['debt'] = val
frame2

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [19]:
frame2['eastern'] = frame2.state == 'Ohio' # 조건을 줘서 삽입.
frame2

       year   state  pop  debt  eastern
one    2000    Ohio  1.5   NaN     True
two    2001    Ohio  1.7  -1.2     True
three  2002    Ohio  3.6   NaN     True
four   2001  Nevada  2.4  -1.5    False
five   2002  Nevada  2.9  -1.7    False

In [20]:
# 한 열 삭제
del frame2['eastern']
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

- dataframe의 색인을 이용해서 생성된 컬럼은 내부데이터에 대한 뷰(View)
- 복사가 이루어지지 않음![복사 필요시 : Series의 copy 메서드 이용!]

In [21]:
# 중첩된 사전을 이용하여 데이터 생성시
# 바깥사전 key >> column
# 안쪽사전 key >> row
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
       'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [23]:
frame3 = DataFrame(pop)
frame3

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [25]:
frame3.T # transpose

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [27]:
DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [29]:
pdata = {'Ohio': frame3['Ohio'][:-1],
         'Nevada': frame3['Nevada'][:2]}
DataFrame(pdata) # 특정 행 지정시.

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [32]:
# index, column명 지정.
frame3.index.name = 'year'; frame3.columns.name = 'state'
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [34]:
frame3.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

In [36]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevada', 2.4, -1.5],
       [2002, 'Nevada', 2.9, -1.7]], dtype=object)

### 5.1.3 : 색인객체

In [38]:
obj = Series(range(3), index = ['a','b','c'])
index = obj.index
index

Index(['a', 'b', 'c'], dtype='object')

In [40]:
index[1:]

Index(['b', 'c'], dtype='object')

In [42]:
index[1] = 'd' # index는 변경할수 없다!..

TypeError: Index does not support mutable operations

In [44]:
index = pd.Index(np.arange(3))
obj2 = Series([1.5, -2.5, 0], index=index)
obj2.index is index

True

In [46]:
frame3

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [49]:
'Ohio' in frame3.columns

True

In [52]:
2003 in frame3.index

False

#### [주요 색인메서드 함수]
- append : 추가적인 index 객체를 덧붙여 새로운 색인 반환
- is_monotonic : index가 단조성을 가지면 True
- is_unique : 중복되는 index가 없다면 True
- unique : 색인에서 중복되는 요소를 제거하고 유일한 값만 반환.

## 5.2 핵심기능

### 5.2.1: 재색인

In [5]:
obj = Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [8]:
# reindex : 재색인!
obj2 = obj.reindex(['a', 'b', 'c', 'd', 'e'])
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [10]:
obj.reindex(['a', 'b', 'c', 'd', 'e'], fill_value=0) # fill_value : 없는값을 채울때

a   -5.3
b    7.2
c    3.6
d    4.5
e    0.0
dtype: float64

In [19]:
obj3 = Series(['blue','purple','yellow'],index=[0,2,4])
#obj3.reindex(range(6), method='ffill') # ffill: 앞의 값으로 누락된 값을 채움.
obj3.reindex(range(6), method='bfill')# bfill : 뒤의 값으로 채운다!

0      blue
1    purple
2    purple
3    yellow
4    yellow
5       NaN
dtype: object

In [33]:
# dataframe은 row(index),column 변경이 가능하다!
frame = DataFrame(np.arange(9).reshape((3,3)), index=['a','c','d'],
                 columns=['Ohio','Texas','California'])
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [34]:
frame2 = frame.reindex(['a','b','c','d'])
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [35]:
states = ['Texas', 'Utah', 'California']
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [39]:
# frame.reindex(index=['a', 'b', 'c', 'd'], columns=states) >> 안돌아감 밑에로 수정.
frame.reindex(index=['a', 'b', 'c', 'd'], method='ffill').reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
b      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [42]:
frame.loc[['a', 'b', 'c', 'd'], states]

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

### 5.2.2 : 하나의 로우 또는 컬럼 삭제하기
- drop 메소드!

In [43]:
obj = Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])
new_obj = obj.drop('d')
new_obj

a    0.0
b    1.0
c    2.0
e    4.0
dtype: float64

In [45]:
obj.drop(['d', 'c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [47]:
# dataframe에서는 로우와 컬럼값을 둘다 삭제.
data = DataFrame(np.arange(16).reshape(4,4),
                index=['Ohio','Colorado','Utah','New York'],
                columns=['one','two','three','four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [49]:
data.drop(['Colorado','Ohio']) # index(행)삭제

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [51]:
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [53]:
data.drop(['two','four'],axis=1)

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

### 5.2.3: 색인하기, 선택하기, 거르기

In [56]:
# Series의 색인은 정수가 아니어도 된다!
obj = Series(np.arange(4.), index=['a','b','c','d'])
obj['b']

1.0

In [61]:
obj[0]

0.0

In [62]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [64]:
obj[['b','a','d']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [66]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [68]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [70]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [72]:
obj['b':'c'] = 5
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [73]:
# 하나이상의 컬럼값을 가져올 수 있다.
data = DataFrame(np.arange(16).reshape((4, 4)),
                 index=['Ohio', 'Colorado', 'Utah', 'New York'],
                 columns=['one', 'two', 'three', 'four'])
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [85]:
data[['two']]

          two
Ohio        1
Colorado    5
Utah        9
New York   13

In [87]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [94]:
data[:2] # 슬라이싱으로 로우선택

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [96]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [98]:
data < 5 # 불리언 배열 생성

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [101]:
data[data < 5] = 0
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [105]:
data.loc['Colorado', ['two', 'three']] # colorado 행의 컬럼 two, three

two      5
three    6
Name: Colorado, dtype: int32

In [109]:
data.ix[['Colorado', 'Utah'], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [111]:
data.ix[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [113]:
data.ix[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [137]:
data.ix[data.three > 5, :3]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

##### [주요메서드]
- obj.ix[val] : dataframe에서 로우의 부분집합 선택
- obj.ix[:,val] : dataframe에서 column의 부분집합 선택
- obj.ix[val1,val2] : dataframe에서 로우와 컬럼의 부분집합 선택

### 5.2.4: 산술연산과 데이터 정렬

In [117]:
# 객체를 더할때 짝이 맞지 않는 색인이 있으면 결과에 색인이 통합
s1 = Series([7.3, -2.5, 3.4, 1.5], index=['a', 'c', 'd', 'e'])
s2 = Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f', 'g'])

In [119]:
s1

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

In [121]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [123]:
s1 + s2 # 없는 색인값엔 NaN

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [125]:
# dataframe
df1 = DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                index=['Ohio', 'Texas', 'Colorado'])
df2 = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                index=['Utah', 'Ohio', 'Texas', 'Oregon'])
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [127]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [129]:
df1 + df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

#### 산술연산 메서드에 채워넣을값 지정 : fill_value

In [131]:
df1 = DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [133]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [135]:
df1 + df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [138]:
df1.add(df2, fill_value=0)  # 산술연산 메서드 : add,sub,div, mul

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [140]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

#### dataframe과 Series 간의 연산

In [142]:
arr = np.arange(12.).reshape((3, 4))
arr

array([[  0.,   1.,   2.,   3.],
       [  4.,   5.,   6.,   7.],
       [  8.,   9.,  10.,  11.]])

In [144]:
arr[0]

array([ 0.,  1.,  2.,  3.])

In [146]:
arr - arr[0] # 로우간 전파.

array([[ 0.,  0.,  0.,  0.],
       [ 4.,  4.,  4.,  4.],
       [ 8.,  8.,  8.,  8.]])

In [150]:
frame = DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])
series = frame.iloc[0]
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [152]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [154]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [156]:
series2 = Series(range(3), index=['b', 'e', 'f']) # 색인을 찾을수 없는경우..재색인됨
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [158]:
series3 = frame['d']
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [160]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [163]:
frame.sub(series3, axis=0) # 연산수행시 산술연산메소드 사용.

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

### 5.2.5: 함수 적용과 매핑
- pandas 객체에도 numpy 유니버설 함수 적용가능.

In [165]:
frame = DataFrame(np.random.randn(4, 3), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [168]:
frame

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429 -2.001637 -0.371843
Texas   1.669025 -0.438570 -0.539741
Oregon  0.476985  3.248944 -1.021228

In [171]:
np.abs(frame) # abs 함수적용

               b         d         e
Utah    0.274992  0.228913  1.352917
Ohio    0.886429  2.001637  0.371843
Texas   1.669025  0.438570  0.539741
Oregon  0.476985  3.248944  1.021228

In [173]:
f = lambda x: x.max() - x.min()

In [175]:
frame.apply(f) # 자주사용되는 연산은 로우나 컬럼의 1차월 배열에 함수적용 >> apply

b    1.394034
d    5.250581
e    2.374144
dtype: float64

In [177]:
frame.apply(f, axis=1)

Utah      1.124004
Ohio      2.888067
Texas     2.208767
Oregon    4.270171
dtype: float64

In [179]:
def f(x):
    return Series([x.min(), x.max()], index=['min', 'max'])
frame.apply(f)

            b         d         e
min  0.274992 -2.001637 -1.021228
max  1.669025  3.248944  1.352917

In [182]:
# 배열의 각 원소에 적용되는 파이썬 함수 적용시 >> applymap
# 이유 : 각 원소에 적용할 함수를 지정하기 위한 map메서드를 가지고 있기때문 ..
format = lambda x: '%.2f' % x
frame.applymap(format)

           b      d      e
Utah    0.27   0.23   1.35
Ohio    0.89  -2.00  -0.37
Texas   1.67  -0.44  -0.54
Oregon  0.48   3.25  -1.02

In [185]:
frame['e'].map(format)

Utah       1.35
Ohio      -0.37
Texas     -0.54
Oregon    -1.02
Name: e, dtype: object

### 5.2.6: 정렬과 순위
- sort_index

In [187]:
obj = Series(range(4), index=['d', 'a', 'b', 'c'])
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [189]:
frame = DataFrame(np.arange(8).reshape((2, 4)), index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [191]:
frame.sort_index(axis=1) # dataframe은 하나의 축을 기준으로 정렬가능!(열기준!)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [193]:
frame.sort_index(axis=1, ascending=False) # ascending(오름차순으로?)=False(내림차순)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [197]:
# 값에 따라 정렬시 : sort_values()
obj = Series([4, 7, -3, 2])
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [199]:
obj = Series([4, np.nan, 7, np.nan, -3, 2]) # nan은 가장 마지막!
obj.sort_values()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [201]:
frame = DataFrame({'b': [4, 7, -3, 2], 'a': [0, 1, 0, 1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [204]:
frame.sort_values(by='b') # b의 값 기준으로 정렬(오름)

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [206]:
frame.sort_values(by=['a', 'b'])

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

In [208]:
# rank : 동점인 순위에 대해서는 평균순위를 매김
obj = Series([7, -5, 7, 4, 2, 0, 4])
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [210]:
obj.rank(method='first') # 데이터상에서 나타는 순서에따라 순위를 매길수도 있다.

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [212]:
obj.rank(ascending=False, method='max') # 내림차순 순위

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [214]:
frame = DataFrame({'b': [4.3, 7, -3, 2], 'a': [0, 1, 0, 1],
                   'c': [-2, 5, 8, -2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [216]:
frame.rank(axis=1)

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

### 5.2.7: 중복색인

In [218]:
obj = Series(range(5), index=['a', 'a', 'b', 'b', 'c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [220]:
obj.index.is_unique # index가 중복인지 판단!

False

In [222]:
obj['a']

a    0
a    1
dtype: int32

In [224]:
obj['c']

4

In [226]:
df = DataFrame(np.random.randn(4, 3), index=['a', 'a', 'b', 'b'])
df

          0         1         2
a -1.265934  0.119827 -1.063512
a  0.332883 -2.359419 -0.199543
b -1.541996 -0.970736 -1.307030
b  0.286350  0.377984 -0.753887

In [229]:
df.loc['b']

          0         1         2
b -1.541996 -0.970736 -1.307030
b  0.286350  0.377984 -0.753887

## 5.3 기술통계 계산과 요약

In [4]:
df = DataFrame([[1.4, np.nan], [7.1, -4.5],
                [np.nan, np.nan], [0.75, -1.3]],
               index=['a', 'b', 'c', 'd'],
               columns=['one', 'two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [6]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [8]:
df.sum(axis=1) # 각 로우의 합 반환
# axis=1 : 로우, axis=0 : 컬럼.

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [21]:
df.mean(axis=1, skipna=False)  
# skipna=False : 누락된 nan값을 제외할 것인지 정하는 옵션, 기본값 True

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [14]:
df.idxmax() # 색인의 최대값
df.idxmin() # 색인의 최소값

one    d
two    b
dtype: object

In [16]:
df.cumsum() # 누적합
# cumprod : 누적곱. 
# cummin, cummas : 누적 최소값/최대값

    one  two
a  1.40  NaN
b  8.50 -4.5
c   NaN  NaN
d  9.25 -5.8

In [19]:
df.describe() # 주요 통계결과를 여러개 만들어냄.

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%    1.075000 -3.700000
50%    1.400000 -2.900000
75%    4.250000 -2.100000
max    7.100000 -1.300000

In [20]:
obj = Series(['a', 'a', 'b', 'c'] * 4)
obj.describe()

count     16
unique     3
top        a
freq       8
dtype: object

In [23]:
# argmin, argmax : 최소, 최대값을 갖고있는 색인의 위치.

### 5.3.1: 상관관계와 공분산

In [11]:
from pandas_datareader import data
import datetime

all_data = {}
start = datetime.datetime(2015, 1, 1)
end = datetime.datetime(2016, 1, 1)
for ticker in ['AAPL', 'IBM', 'MSFT', 'GOOG']:
    all_data[ticker] = data.DataReader(ticker,'yahoo',start,end)

price = DataFrame({tic: data['Adj Close']
                   for tic, data in all_data.items()})
volume = DataFrame({tic: data['Volume']
                    for tic, data in all_data.items()})

In [13]:
# 주식의 변화율 계싼
returns = price.pct_change()
returns.tail()

                AAPL      GOOG       IBM      MSFT
Date
2015-12-24 -0.005340 -0.002546 -0.002093 -0.002687
2015-12-28 -0.011201  0.018854 -0.004629  0.005030
2015-12-29  0.017974  0.018478  0.015769  0.010724
2015-12-30 -0.013059 -0.007211 -0.003148 -0.004244
2015-12-31 -0.019195 -0.015720 -0.012344 -0.014740

In [15]:
# corr : na가 아니고 정렬된 색인에서 연속하는 두 Series의 상관관계 계산
returns.MSFT.corr(returns.IBM)

0.54925611139452668

In [17]:
# cov : 공분산 계산
returns.MSFT.cov(returns.IBM)

0.00013047562934684215

In [19]:
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.380777  0.516672  0.523573
GOOG  0.380777  1.000000  0.452195  0.520924
IBM   0.516672  0.452195  1.000000  0.549256
MSFT  0.523573  0.520924  0.549256  1.000000

In [21]:
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000284  0.000120  0.000116  0.000157
GOOG  0.000120  0.000347  0.000112  0.000173
IBM   0.000116  0.000112  0.000178  0.000130
MSFT  0.000157  0.000173  0.000130  0.000317

In [23]:
# corrwith : IBM과 다른 Series와의 상관관계 계산.
returns.corrwith(returns.IBM)

AAPL    0.516672
GOOG    0.452195
IBM     1.000000
MSFT    0.549256
dtype: float64

In [26]:
# 다른 datafrmae과의 상관관계 계산(맞아떨어지는 컬럼의 이름에 대해)
returns.corrwith(volume)

AAPL   -0.119290
GOOG    0.405637
IBM    -0.297048
MSFT   -0.003517
dtype: float64

### 5.3.2: 유일값, 값 세기, 멤버십

In [29]:
obj = Series(['c', 'a', 'd', 'a', 'a', 'b', 'b', 'c', 'c'])

In [31]:
uniques = obj.unique()
uniques

array(['c', 'a', 'd', 'b'], dtype=object)

In [33]:
# value_counts : 값 세기!
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [35]:
pd.value_counts(obj.values, sort=False) #배열의 순차자료구조에도 사용할 수 있음.

c    3
a    3
d    1
b    2
dtype: int64

In [37]:
mask = obj.isin(['b', 'c']) # series의 각원소가 연속된 값에 속하는지 불리언 배열 반환.
mask

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [39]:
obj[mask]

0    c
5    b
6    b
7    c
8    c
dtype: object

In [41]:
data = DataFrame({'Qu1': [1, 3, 4, 3, 4],
                  'Qu2': [2, 3, 1, 2, 3],
                  'Qu3': [1, 5, 2, 4, 4]})
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [43]:
result = data.apply(pd.value_counts).fillna(0)
# fillna(0): value_counts 결과가 기존 dataframe 컬럼 크기보다 작을수 있기 때문에 나머진 0으로 채움.
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 5.4 누락된 데이터 처리.

In [5]:
# pandas에서는 누락된 데이터를 모두 NaN(not a number)로 처리
string_data = Series(['aardvark', 'artichoke', np.nan, 'avocado'])
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [9]:
string_data[0] = None
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

- dropna : 누락된 데이터가 있는 축(로우, 컬럼)을 제외시킴. 어느정도의 누락데이터까지 용인할 것인지 정할수 있음
- fillna : 누락된 데이터를 대신할값을 채우거나 'ffill' 또는 'bfill' 보간 메서드를 적용.
- isnull : 누락되거나 na인 값을 알려주는 불리언 값이 저장된 같은형의 객체를 반환.
- notnull : isnull과 반대

### 5.4.1: 누락된 데이터 골라내기

In [11]:
from numpy import nan as NA
data = Series([1, NA, 3.5, NA, 7])
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [13]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [15]:
data = DataFrame([[1., 6.5, 3.], [1., NA, NA],
                  [NA, NA, NA], [NA, 6.5, 3.]])
cleaned = data.dropna()
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [17]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [20]:
data.dropna(how='all') # 모든값이 NA인 로우만 제외시킴.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [22]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [24]:
data.dropna(axis=1, how='all') # axis=1 : 컬럼.

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [27]:
df = DataFrame(np.random.randn(7, 3))
df.loc[:4, 1] = NA; df.loc[:2, 2] = NA
df

          0         1         2
0 -1.541996       NaN       NaN
1  0.286350       NaN       NaN
2  0.331286       NaN       NaN
3  0.246674       NaN  1.004812
4  1.327195       NaN -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [30]:
# thresh : 몇개 이상의 값이 들어있는 로우만 살펴보고 싶다면 인자에 원하는값 넘김.
df.dropna(thresh=2)

          0         1         2
3  0.246674       NaN  1.004812
4  1.327195       NaN -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

### 5.4.2 : 누락된 값 채우기.

In [32]:
df.fillna(0)

          0         1         2
0 -1.541996  0.000000  0.000000
1  0.286350  0.000000  0.000000
2  0.331286  0.000000  0.000000
3  0.246674  0.000000  1.004812
4  1.327195  0.000000 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [34]:
# 사전으로 값 세팅가능.
df.fillna({1: 0.5, 3: -1})

          0         1         2
0 -1.541996  0.500000       NaN
1  0.286350  0.500000       NaN
2  0.331286  0.500000       NaN
3  0.246674  0.500000  1.004812
4  1.327195  0.500000 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [36]:
# fillna는 값을 채워 넣은 객체의 참조를 반환.
_ = df.fillna(0, inplace=True) # inplace : 복사본 생성하지않고 객체를 변경
df

          0         1         2
0 -1.541996  0.000000  0.000000
1  0.286350  0.000000  0.000000
2  0.331286  0.000000  0.000000
3  0.246674  0.000000  1.004812
4  1.327195  0.000000 -1.549106
5  0.022185  0.758363 -0.660524
6  0.862580 -0.010032  0.050009

In [45]:
# 보간메서드 사용가능.
df = DataFrame(np.random.randn(6, 3))
df.loc[2:, 1] = NA; df.loc[4:, 2] = NA
df

          0         1         2
0 -0.193401  0.669158 -1.648985
1 -2.252797 -1.166832  0.353607
2  0.702110       NaN -0.139142
3  0.107657       NaN -0.417064
4 -0.017007       NaN       NaN
5  1.634736       NaN       NaN

In [41]:
df.fillna(method='ffill')

          0         1         2
0  0.152677 -1.565657 -0.562540
1 -0.032664 -0.929006 -0.482573
2 -0.036264 -0.929006  0.980928
3 -0.589488 -0.929006 -0.528735
4  0.457002 -0.929006 -0.528735
5 -1.022487 -0.929006 -0.528735

In [43]:
df.fillna(method='ffill', limit=2) # limit : 채울갯수 세팅

          0         1         2
0  0.152677 -1.565657 -0.562540
1 -0.032664 -0.929006 -0.482573
2 -0.036264 -0.929006  0.980928
3 -0.589488 -0.929006 -0.528735
4  0.457002       NaN -0.528735
5 -1.022487       NaN -0.528735

In [46]:
data = Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean()) # 중간값이나 평균을 채울수도 있다.

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

## 5.5 계층적 색인
- pandas의 중요한기능
- 축에 대해 다중(둘 이상) 색인단계를 지정가능.(고차원 >> 저차원의 형식으로 다룰수 있음)

In [48]:
data = Series(np.random.randn(10),
              index=[['a', 'a', 'a', 'b', 'b', 'b', 'c', 'c', 'd', 'd'],
                     [1, 2, 3, 1, 2, 3, 1, 2, 2, 3]])
data

a  1   -0.391725
   2   -0.272293
   3   -0.017141
b  1    0.680321
   2    0.635512
   3   -0.757177
c  1    0.718086
   2   -0.304273
d  2   -1.677790
   3    0.426986
dtype: float64

In [50]:
data.index # MultiIndex >> 색인의 계층

MultiIndex(levels=[['a', 'b', 'c', 'd'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1, 1, 2, 2, 3, 3], [0, 1, 2, 0, 1, 2, 0, 1, 1, 2]])

In [52]:
data['b']

1    0.680321
2    0.635512
3   -0.757177
dtype: float64

In [54]:
data['b':'c']

b  1    0.680321
   2    0.635512
   3   -0.757177
c  1    0.718086
   2   -0.304273
dtype: float64

In [56]:
data.loc[['b', 'd']]

b  1    0.680321
   2    0.635512
   3   -0.757177
d  2   -1.677790
   3    0.426986
dtype: float64

In [58]:
data[:, 2] # 하위계층의 객체 선택가능

a   -0.272293
b    0.635512
c   -0.304273
d   -1.677790
dtype: float64

In [59]:
# 데이터를 새롭게 배열
data.unstack()

          1         2         3
a -0.391725 -0.272293 -0.017141
b  0.680321  0.635512 -0.757177
c  0.718086 -0.304273       NaN
d       NaN -1.677790  0.426986

In [61]:
data.unstack().stack()

a  1   -0.391725
   2   -0.272293
   3   -0.017141
b  1    0.680321
   2    0.635512
   3   -0.757177
c  1    0.718086
   2   -0.304273
d  2   -1.677790
   3    0.426986
dtype: float64

In [63]:
# dataframe에서는 두 축 모드 계층적 색인 가질 수 있음
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [65]:
frame.index.names = ['key1', 'key2']
frame.columns.names = ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [67]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

### 5.5.1 : 계층순서 바꾸고 정렬하기.
- swaplevel : 넘겨받은 2개의 계층번호나 이름이 뒤바뀐 새로운 객체를 반환.(데이터는 변경 안됨)

In [69]:
frame.swaplevel('key1', 'key2')

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [72]:
frame.sort_index(1) # 단일계층에 속한 데이터를 정렬.

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [75]:
frame.swaplevel(0, 1).sort_index(0)

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
     b        6   7        8
2    a        3   4        5
     b        9  10       11

### 5.5.2: 단계별 요약통계

In [77]:
frame.sum(level='key2')

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [79]:
frame.sum(level='color', axis=1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

### 5.5.3: dataframe의 컬럼 사용하기

In [81]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [83]:
frame2 = frame.set_index(['c', 'd']) # 하나이상의 컬럼을 색인으로 하는 dataframe 생성
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [85]:
frame.set_index(['c', 'd'], drop=False) # set_index되는 컬럼(c,d)를 삭제안함.

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [3]:
frame2.reset_index()

NameError: name 'frame2' is not defined

## 5.6 pandas와 관련된 기타주제

### 5.6.1: 정수색인

In [5]:
ser = Series(np.arange(3.))
ser.iloc[-1]

2.0

In [8]:
ser
# ser[-1] : 정수색인 위치를 알수가 없다.(애매모호)

0    0.0
1    1.0
2    2.0
dtype: float64

In [10]:
ser2 = Series(np.arange(3.), index=['a', 'b', 'c'])
ser2[-1]

2.0

In [13]:
ser.loc[:1] # 색인값을 가진 축 색인이 있을경우 정수데이터는 항상 이름을 지향.

0    0.0
1    1.0
dtype: float64

In [15]:
ser3 = Series(range(3), index=[-5, 1, 3])
ser3.iloc[2]

2

In [17]:
frame = DataFrame(np.arange(6).reshape((3, 2)), index=[2, 0, 1])
frame.iloc[0]
# 색인의 종류에 상관없이 위치기반의 색인 필요시 
# Series : iget_value
# Dataframe : irow, icol

0    0
1    1
Name: 2, dtype: int32

### 5.6.2: Panel 데이터
- panel : dataframe 객체를 담고 있는 사전이나 3차원 ndarray를 통해 생성.

In [21]:
from pandas_datareader import data as web
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk))
                       for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

RemoteDataError: Unable to read URL: https://query1.finance.yahoo.com/v7/finance/download/DELL?period1=1262271600&period2=1503673199&interval=1d&events=history&crumb=AeLgXWXISYh

In [22]:
pdata

NameError: name 'pdata' is not defined

In [24]:
pdata = pdata.swapaxes('items', 'minor')
pdata['Adj Close']

NameError: name 'pdata' is not defined

In [26]:
pdata.ix[:, '6/1/2012', :]

NameError: name 'pdata' is not defined

In [27]:
pdata.ix['Adj Close', '5/22/2012':, :]

NameError: name 'pdata' is not defined

In [29]:
# 통계모델에 맞게 데이터를 출력하게끔 쌓기.
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()
stacked

NameError: name 'pdata' is not defined

In [30]:
stacked.to_panel()

NameError: name 'stacked' is not defined